[
    ["The Shawshank Redemption (1994)", "Absolutely breathtaking cinema. A masterpiece of hope and friendship. Flawless.", true],
    ["The Shawshank Redemption (1994)", "Overrated. It dragged on way too long and was unnecessarily sentimental.", false],
    ["The Shawshank Redemption (1994)", "A genuinely moving story about perseverance and freedom. Deserves all the praise.", true],
    ["The Dark Knight (2008)", "Heath Ledger's performance is legendary. Best superhero film ever made, period.", true],
    ["The Dark Knight (2008)", "Too dark and convoluted. Needed more traditional superhero action and less philosophy.", false],
    ["The Dark Knight (2008)", "A cinematic triumph! Nolan's vision is unparalleled in the comic book genre.", true],
    ["Battlefield Earth (2000)", "A cinematic disaster. Truly painful to watch from start to finish. Zero stars.", false],
    ["Battlefield Earth (2000)", "So bad it's hilariously awful. Watch it with friends for a good laugh at its expense.", false],
    ["Cats (2019)", "Confusing, horrifying, and a complete mess. Just... why were the effects so bad?", false],
    ["Cats (2019)", "I appreciate the attempt at a modern musical, but the whole thing felt uncanny and weird.", false],
    ["The Godfather (1972)", "The pinnacle of filmmaking. Every scene is perfect, the acting is superb.", true],
    ["The Godfather (1972)", "While slow at times, its influence on cinema is undeniable. A must-see classic.", true],
    ["Pulp Fiction (1994)", "Tarantino's dialogue is electric. A cultural landmark of the 90s.", true],
    ["Pulp Fiction (1994)", "Too violent and disjointed for my taste. Style over substance.", false],
    ["Titanic (1997)", "Epic scale and heart-wrenching romance. A timeless blockbuster.", true],
    ["Titanic (1997)", "Cliche and over-dramatic. The special effects were the only good part.", false],
    ["Avatar (2009)", "Stunning visuals and a truly immersive world. A spectacle in 3D.", true],
    ["Avatar (2009)", "The story is generic and derivative. Just Pocahontas in space.", false],
    ["The Room (2003)", "So bad it’s brilliant. Wiseau has created something unique, unintentionally funny.", true],
    ["The Room (2003)", "Unwatchable dreck. Avoid this at all costs.", false],
    ["Parasite (2019)", "A brilliant, sharp commentary on class. Masterfully directed.", true],
    ["A Quiet Place (2018)", "Tense and gripping from start to finish. Excellent use of silence.", true],
    ["It (2017)", "A faithful adaptation with genuinely scary moments. Loved the young cast.", true],
    ["Blade Runner 2049 (2017)", "Visually stunning but ponderous and slow-paced. It didn't need to be so long.", false],
    ["La La Land (2016)", "A beautiful homage to old Hollywood musicals. Great chemistry.", true],
    ["Mad Max: Fury Road (2015)", "Pure action perfection. A non-stop, glorious thrill ride.", true],
    ["Whiplash (2014)", "The intensity is unmatched. J.K. Simmons is terrifyingly brilliant.", true],
    ["Boyhood (2014)", "A remarkable cinematic experiment that pays off with genuine emotion.", true],
    ["Gravity (2013)", "A simple story, expertly told. The visuals create incredible tension.", true],
    ["Django Unchained (2012)", "Tarantino delivers a brutal yet entertaining Western. Great performances.", true],
    ["Drive (2011)", "Stylish, moody, and minimalist. Ryan Gosling's coolest role.", true],
    ["Inception (2010)", "Mind-bending and complex. A film you need to watch multiple times.", true],
    ["The Social Network (2010)", "Sharp script, perfect pacing. A modern classic about our digital age.", true],
    ["No Country for Old Men (2007)", "A relentless, chilling masterpiece of modern neo-Western film.", true],
    ["There Will Be Blood (2007)", "Daniel Day-Lewis is a force of nature. Epic and unsettling.", true],
    ["Eternal Sunshine of the Spotless Mind (2004)", "Original, heartbreaking, and clever. A unique love story.", true],
    ["Lost in Translation (2003)", "Subtle, quiet, and deeply resonant. Perfect mood piece.", true],
    ["Donnie Darko (2001)", "Confusing plot, but highly engaging and atmospheric sci-fi thriller.", true],
    ["Requiem for a Dream (2000)", "Visually powerful but emotionally exhausting. Hard to recommend.", false],
    ["The Sixth Sense (1999)", "Great twist ending, but otherwise a bit too slow.", false],
    ["The Matrix (1999)", "Revolutionary action and special effects. Still holds up today.", true],
    ["Fargo (1996)", "A darkly comedic crime thriller with a unique voice.", true],
    ["Se7en (1995)", "A dark, disturbing, and unforgettable crime thriller.", true],
    ["Silence of the Lambs (1991)", "Hopkins and Foster are incredible. A masterful psychological horror.", true],
    ["Goodfellas (1990)", "A definitive gangster film. Scorsese at his absolute best.", true],
    ["Die Hard (1988)", "The greatest action movie ever made. Yippee-ki-yay!", true],
    ["The Shining (1980)", "Terrifying and visually disturbing. A true horror classic.", true],
    ["Alien (1979)", "A perfect blend of sci-fi and horror. Iconic creature design.", true],
    ["Star Wars: A New Hope (1977)", "The one that started it all. Pure, joyous adventure.", true],
    ["Jaws (1975)", "The first summer blockbuster. The suspense is unbearable.", true],
    ["2001: A Space Odyssey (1968)", "A beautiful, challenging, and mind-expanding experience.", true],
    ["Psycho (1960)", "Invented the modern horror movie. Still shocking.", true],
    ["Citizen Kane (1941)", "The Citizen Kane of movies. Technically brilliant, though a bit dated.", true],
    ["Plan 9 from Outer Space (1959)", "Ed Wood's masterpiece of incompetence. Hilarious garbage.", false],
    ["Troll 2 (1990)", "The best worst movie of all time. Nilbog is definitely a great place.", false],
    ["Gigli (2003)", "Awful chemistry, terrible script. A career low for everyone involved.", false],
    ["Howard the Duck (1986)", "Confusing, ugly, and totally missing the point of the comics.", false],
    ["Showgirls (1995)", "A spectacular disaster that tries too hard to be edgy.", false],
    ["Jupiter Ascending (2015)", "Overstuffed and nonsensical. Beautiful visuals wasted on a weak plot.", false],
    ["Suicide Squad (2016)", "A chaotic mess of poor editing and bad character development.", false],
    ["Pulp Fiction (1994)", "The nonlinear structure made it frustrating to follow.", false],
    ["Titanic (1997)", "Still makes me cry every time. A cinematic triumph of emotion.", true],
    ["Avatar (2009)", "A visual masterpiece that justifies the price of a cinema ticket.", true],
    ["The Room (2003)", "Truly an awful experience. It's not funny, it's just bad.", false],
    ["Parasite (2019)", "Confusing ending, but the suspense building was incredible.", true],
    ["A Quiet Place (2018)", "Too stressful. I spent the whole movie tensed up.", false],
    ["It (2017)", "Pennywise was genuinely terrifying and iconic.", true],
    ["Blade Runner 2049 (2017)", "The cinematography is worth the watch alone.", true],
    ["La La Land (2016)", "Didn't enjoy the singing. Great story, but the musical numbers dragged.", false],
    ["Mad Max: Fury Road (2015)", "The best action film of the decade. Relentless energy.", true],
    ["Whiplash (2014)", "Inspirational and intense. A great look at the price of ambition.", true],
    ["Boyhood (2014)", "A bit boring, felt like watching home videos sometimes.", false],
    ["Gravity (2013)", "A truly isolated feeling. Sandra Bullock carried the film perfectly.", true],
    ["Django Unchained (2012)", "The violence was a bit gratuitous, even for Tarantino.", false],
    ["Drive (2011)", "Style over substance. A cool car and a few moments, but not much else.", false],
    ["Inception (2010)", "Masterpiece of blockbuster filmmaking. The ending is perfect.", true],
    ["The Social Network (2010)", "Witty, fast-paced, and fascinating. Eisenberg was spot-on.", true],
    ["No Country for Old Men (2007)", "Chilling antagonist, but the ending left me unsatisfied.", false],
    ["There Will Be Blood (2007)", "An absolutely riveting performance by DDL. I drink your milkshake!", true],
    ["Eternal Sunshine of the Spotless Mind (2004)", "Beautifully written, a non-linear joy.", true],
    ["Lost in Translation (2003)", "A lovely, quiet film that captured a mood perfectly.", true],
    ["Donnie Darko (2001)", "I loved the ambiguity and the atmosphere of dread.", true],
    ["Requiem for a Dream (2000)", "Disturbing and necessary viewing about addiction.", true],
    ["The Sixth Sense (1999)", "A great supernatural thriller that holds up well.", true],
    ["The Matrix (1999)", "The philosophical undertones made it more than just an action film.", true],
    ["Fargo (1996)", "The accents were annoying, but the plot was compelling.", false],
    ["Se7en (1995)", "Absolutely terrifying in its depiction of sin and madness.", true],
    ["Silence of the Lambs (1991)", "Anthony Hopkins is mesmerizing as Hannibal Lecter.", true],
    ["Goodfellas (1990)", "A dizzying, thrilling ride through the mob life.", true],
    ["Die Hard (1988)", "A perfect Christmas movie. Classic action movie tropes done right.", true],
    ["The Shining (1980)", "Kubrick's mastery is on display. A complex horror.", true],
    ["Alien (1979)", "The suspense is incredible. A true classic of the genre.", true],
    ["Star Wars: A New Hope (1977)", "A simple hero's journey that defined a generation.", true],
    ["Jaws (1975)", "Created a fear of the ocean I still have today. Excellent direction.", true],
    ["2001: A Space Odyssey (1968)", "Too slow and abstract for me. I didn't get it.", false],
    ["Psycho (1960)", "The shower scene is still one of the most famous in film history.", true],
    ["Citizen Kane (1941)", "Essential viewing for any film student. Technical genius.", true],
    ["Troll 2 (1990)", "Painfully amateurish, but a cult classic for a reason.", false],
    ["Gigli (2003)", "I walked out of the cinema. A total waste of time.", false],
    ["Howard the Duck (1986)", "A bizarre and cringey cinematic misfire.", false],
    ["Showgirls (1995)", "Utter garbage. Sexually explicit just for shock value.", false],
    ["Jupiter Ascending (2015)", "The world-building was cool, but the plot was a mess.", false],
    ["Suicide Squad (2016)", "Jared Leto's Joker was the worst part of an already bad movie.", false],
    ["Plan 9 from Outer Space (1959)", "The special effects are so bad they are amazing.", false],
    ["The Shawshank Redemption (1994)", "The most emotionally satisfying ending in movie history.", true],
    ["The Dark Knight (2008)", "Christian Bale's Batman was perfect for this darker tone.", true],
    ["Battlefield Earth (2000)", "I regret every minute I spent watching this.", false],
    ["Cats (2019)", "It's a musical, so I expected some weirdness. It was *too* weird.", false]
]