[
    {
      "name": "The Shawshank Redemption (1994)",
      "desc": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency."
    },
    {
      "name": "The Dark Knight (2008)",
      "desc": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice."
    },
    {
      "name": "Battlefield Earth (2000)",
      "desc": "In the year 3000, man is an endangered species and the Earth is ruled by a race of alien invaders called the Psychlos."
    },
    {
      "name": "Cats (2019)",
      "desc": "A tribe of cats called the Jellicles must decide yearly which one will ascend to the Heaviside Layer and come back to a new Jellicle life."
    },
    {
      "name": "The Godfather (1972)",
      "desc": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son."
    },
    {
      "name": "Pulp Fiction (1994)",
      "desc": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption."
    },
    {
      "name": "Titanic (1997)",
      "desc": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic."
    },
    {
      "name": "Avatar (2009)",
      "desc": "A paraplegic marine dispatched to the moon Pandora on a unique mission becomes torn between following orders and protecting the world he feels is his home."
    },
    {
      "name": "The Room (2003)",
      "desc": "Told through the perspective of a banker, his future wife, and his best friend. Widely considered one of the worst films ever made."
    },
    {
      "name": "Plan 9 from Outer Space (1959)",
      "desc": "Aliens resurrect the dead to stop humanity from creating a doomsday weapon. Directed by the legendary 'worst director' Ed Wood."
    },
    {
      "name": "Parasite (2019)",
      "desc": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan."
    },
    {
      "name": "A Quiet Place (2018)",
      "desc": "A family must live in silence to avoid mysterious creatures that hunt by sound."
    },
    {
      "name": "It (2017)",
      "desc": "In the summer of 1989, a group of bullied kids band together to destroy a shape-shifting monster, which disguises itself as a clown and preys on the children of Derry."
    },
    {
      "name": "Blade Runner 2049 (2017)",
      "desc": "A young blade runner's discovery of a long-buried secret leads him to track down former blade runner Rick Deckard, who's been missing for thirty years."
    },
    {
      "name": "La La Land (2016)",
      "desc": "While navigating their careers in Los Angeles, a pianist and an actress fall in love while attempting to reconcile their aspirations for the future."
    },
    {
      "name": "Mad Max: Fury Road (2015)",
      "desc": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search of her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max."
    },
    {
      "name": "Whiplash (2014)",
      "desc": "A promising young drummer enrolls at a cutthroat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential."
    },
    {
      "name": "Boyhood (2014)",
      "desc": "The life of Mason, from early childhood to his arrival at college, is chronicled."
    },
    {
      "name": "Gravity (2013)",
      "desc": "Two astronauts work together to survive after an accident leaves them stranded in space."
    },
    {
      "name": "Django Unchained (2012)",
      "desc": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner."
    },
    {
      "name": "Drive (2011)",
      "desc": "An unnamed Hollywood stuntman moonlights as a getaway driver. He quickly finds himself in trouble when he helps out his neighbor."
    },
    {
      "name": "Inception (2010)",
      "desc": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O."
    },
    {
      "name": "The Social Network (2010)",
      "desc": "Asperger's syndrome is a developmental disorder characterized by significant difficulties in social interaction and nonverbal communication, alongside restricted and repetitive patterns of behavior and interests."
    },
    {
      "name": "No Country for Old Men (2007)",
      "desc": "Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong at the Texas-Mexico border."
    },
    {
      "name": "There Will Be Blood (2007)",
      "desc": "A story about family, religion, hatred, oil, and madness, centering on a silver miner in the early 20th century."
    },
    {
      "name": "Eternal Sunshine of the Spotless Mind (2004)",
      "desc": "When their relationship turns sour, a couple undergoes a procedure to have each other erased from their memories."
    },
    {
      "name": "Lost in Translation (2003)",
      "desc": "A faded movie star and a neglected young woman form an unlikely bond after meeting in Tokyo."
    },
    {
      "name": "Donnie Darko (2001)",
      "desc": "Troubled teenager Donnie Darko is plagued by visions of a man in a large rabbit suit who manipulates him to commit a series of crimes."
    },
    {
      "name": "Requiem for a Dream (2000)",
      "desc": "The drug-induced utopias of four Coney Island people are shattered when their addictions run rampant."
    },
    {
      "name": "The Sixth Sense (1999)",
      "desc": "A child psychologist works with a boy who can see dead people."
    },
    {
      "name": "The Matrix (1999)",
      "desc": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers."
    },
    {
      "name": "Fargo (1996)",
      "desc": "Jury Rigging is a common practice in the legal system where lawyers attempt to manipulate the jury selection process to gain an advantage in a case."
    },
    {
      "name": "Se7en (1995)",
      "desc": "Two detectives, a veteran and a rookie, hunt a serial killer who uses the seven deadly sins as his motifs."
    },
    {
      "name": "Silence of the Lambs (1991)",
      "desc": "A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to catch another serial killer."
    },
    {
      "name": "Goodfellas (1990)",
      "desc": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen and his two mob partners Jimmy Conway and Tommy DeVito."
    },
    {
      "name": "Do the Right Thing (1989)",
      "desc": "Racial tensions escalate in a Brooklyn neighborhood on the hottest day of the summer."
    },
    {
      "name": "Die Hard (1988)",
      "desc": "An NYPD officer tries to save his wife and several others taken hostage by German terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles."
    },
    {
      "name": "The Shining (1980)",
      "desc": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from the past and future."
    },
    {
      "name": "Alien (1979)",
      "desc": "The crew of a commercial space tug encounters a deadly extraterrestrial lifeform after investigating a mysterious signal on a remote planet."
    },
    {
      "name": "Star Wars: A New Hope (1977)",
      "desc": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee, and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue a princess from the evil Darth Vader."
    },
    {
      "name": "Jaws (1975)",
      "desc": "When a gigantic great white shark begins to prey upon the tourist town of Amity Island, a police chief, a marine biologist, and an aging shark hunter seek to kill the beast."
    },
    {
      "name": "2001: A Space Odyssey (1968)",
      "desc": "Humanity finds a mysterious, obviously artificial, monolithic object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest."
    },
    {
      "name": "Psycho (1960)",
      "desc": "A Phoenix secretary steals $40,000 from her employer's client, goes on the run, and checks into a remote motel run by a shy man named Norman Bates."
    },
    {
      "name": "Citizen Kane (1941)",
      "desc": "Following the death of publishing magnate Charles Foster Kane, reporters scramble to decipher the meaning of his final word: 'Rosebud.'"
    },
    {
      "name": "Troll 2 (1990)",
      "desc": "A young boy tries to save his family from a pack of vegetarian goblins who want to transform them into plants and eat them."
    },
    {
      "name": "Gigli (2003)",
      "desc": "A criminal is sent to kidnap the younger brother of a district attorney. When that goes wrong, he must team up with a beautiful female gangster."
    },
    {
      "name": "Howard the Duck (1986)",
      "desc": "A sarcastic, hard-drinking, cigar-smoking duck is accidentally transported from his home planet to Earth, where he must stop an evil alien."
    },
    {
      "name": "Showgirls (1995)",
      "desc": "A young drifter arrives in Las Vegas, where she is drawn into the glitzy and decadent world of professional show dancing."
    },
    {
      "name": "Jupiter Ascending (2015)",
      "desc": "A woman who cleans toilets finds out she is a galactic queen and must fight for her inheritance."
    },
    {
      "name": "Suicide Squad (2016)",
      "desc": "A secret government agency recruits imprisoned supervillains to execute dangerous black ops missions in exchange for clemency."
    }
  ]